Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) Экспорт
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры



Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	Представление = Данные.Наименование;
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		Представление = Представление + " (" + Данные.ДействуетНаОсновании + ")";
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры